d = {
    '永恒族': '''永恒族于1976年由杰克·科比创造，是远古人类种族，在100万年前由天神族(Celestials)创造，拥有心理操控有限数量的宇宙能量的遗传潜
能，以及其他超人类的特性。
在漫威漫画的故事中，最早是由宇宙中个头超大、几乎全能的天神族提取了地球物种的基因创造了永恒族、异能者和人类三种族群。其中永恒族是拥有超能力的神，异
能者是实验失败的怪物，人类在在两者中间，没有超能力，也不是怪物。
在漫画里，永恒族(也叫永恒者或永恒神族)的传说可以追溯到几百万年前，那时被称为天神族的生物在人类身上进行了大量基因实验，创造出了两种人类后代，一种是
拥有超能力的不朽生物永恒者(The Eternals)，另一种是畸形的异常者(The Deviants)。两个种族建立起了各自的社会，并在人类未知的领域内活动。''',
    '尚气与十戒传奇 ': '''《尚气与十戒传奇》中除了男女主之外，还出现了许多复联中的漫威英雄，这也表明了尚气最终是必定要添加复联的，变成复联新的英
雄人物。
作为现阶段漫威世界中高于一切的法师，奇异博士并没有发生在这一次的尚气联动中，可是有一个人则是经常的出现，那就是王，以前奇异博士的导师之一。''',
    '死侍': '''该片是《X战警》系列电影的外传。讲述了前任特种兵韦德·威尔逊得了不治之症，而自愿加入“X武器计划”获得了快速自愈能力。在饱受虐待折磨后
他成功逃脱并对Ajax进行追杀的故事。 
在原著漫画中，死侍本是个普通人，由于得了不治之症而自愿加入“X武器计划”，他如愿得到了金刚狼自我愈合的能力，但付出的代价是失去了容貌。史崔克将军把他
作为失败品投入监狱折磨并继续研究，最终导致他的出逃。死侍是个亦正亦邪的角色，他拥有超越人类的力量、耐力、速度及自我愈合能力，精通各种武器，擅长搏击
术，不过他的精神不太稳定。''',
    '毒液': '''记者埃迪·布洛克（汤姆·哈迪 饰）在调查生命基金会的最新科学实验过程中，受到不明外星物质共生体的入侵与控制，历经挣扎成为亦正亦邪的超
级英雄——毒液。他将以毒攻毒，破解生命基金会的惊天阴谋，拯救世界。''',
    '毒液2': '''《毒液2》中，尖叫和屠杀（Carnage，由伍迪·哈里森饰演）是一对情侣，两人将成为毒液的最强对手。
《毒液2》仍然由汤姆·哈迪饰演毒液，第二部《毒液》还是会和系列保持步调一致，整体基调不会变化太大——它还会是黑暗且狂野的。''',
    '鹰眼': '''中东某地，美国军方的情报系统锁定了一名目标人物，总统不顾系统电脑运算出的建议处理方式，下令定点 清除，由此引发了意外的连锁反应。公
司小职员杰瑞（希亚·拉博夫饰）的生活平淡乏味，时常手头拮据，连房租也成了问题，由于供职于军方的孪生兄弟意外过世，杰瑞赶回家中参加葬礼，但此行归来后，
杰瑞发现家中居然堆满了武器，随即赶到的FBI破窗而入将他逮捕。与此同时，名叫蕾切尔（米歇尔·莫娜汉饰）的女人从大街上的电子广告牌上得知自己的儿子被某人
绑架，绑架者拥有超乎寻常的能力，能够控制电子产品并监控一切。这名绑架者引导杰瑞摆脱FBI，最终上了蕾切尔的车，两名陌生人被迫合作，在FBI的追捕中落入了
神秘绑架者的计划。''',
    '正义联盟': '''《正义联盟》是由扎克·施奈德执导，克里斯·特里奥、乔斯·韦登编剧，本·阿弗莱克，亨利·卡维尔，盖尔·加朵等主演的动作奇幻电影。 
影片改编自DC漫画，是DC扩展宇宙的第五部影片。故事发生在《蝙蝠侠大战超人：正义黎明》之后，主要讲述了面对一个全新的世界威胁，超人、蝙蝠侠、神奇女侠、
闪电侠、海王和钢骨六位英雄聚首，与这股未知的威胁对抗。
影片于2017年11月17日在北美与中国内地同步上映。''',
    '蝙蝠侠': '''蝙蝠侠（Batman），是美国DC漫画旗下超级英雄，初次登场于《侦探漫画》（Detective Comics）第27期（1939年5月），由鲍勃·凯恩
（Bob Kane）和比尔·芬格（Bill Finger）联合创造，是漫画史上第一位没有超能力的超级英雄。
第一代是布鲁斯·韦恩出生在哥谭市四大家族之一的韦恩家族中。一天晚上，父母带着年幼的布鲁斯看完电影《佐罗》回家，途经一条小径时遭遇歹徒的抢劫。歹徒当
着布鲁斯的面枪杀了他的父母。从此，布鲁斯便产生了亲手铲除罪恶的强烈愿望，为了不让其他人再遭受到与自己同样的悲剧，凭借着过人的天赋，布鲁斯利用几十年
时间游历世界各地，拜访东西方顶级或传说中的格斗大师，学习各流派格斗术，后回到美国，利用强大的财力制造各种高科技装备。此后在白天，他是别人眼中的无脑
富二代、花花公子；夜晚，他是令罪犯闻风丧胆的黑暗骑士——蝙蝠侠（Batman）。''',
    '闪电侠': '''《闪电侠》（The Flash）改编自同名DC漫画，是DC娱乐和华纳联手CW电视网制作，由戴维·纳特执导，格兰特·古斯汀、坎迪斯·帕顿、
杰西·马丁、汤姆·加瓦那主演的真人超级英雄系列剧。
该剧讲述了巴里·艾伦，一名为警署工作的科学家，使用他的超级速度来对抗超级反派们。
本剧第一季于2014年10月7日在美国CW电视网首播，第二季于2015年10月6日播出，第三季于2016年10月4日播出，第四季已获续订。''',
    '神奇女侠': '''《神奇女侠》是由美国华纳兄弟影片公司出品的奇幻动作片，由派蒂·杰金斯执导，盖尔·加朵、克里斯·派恩、康妮·尼尔森、罗宾·怀特联合主
演。 
影片讲述了亚马逊公主戴安娜原本生活在天堂岛上，那里的居民都长生不老拥有神力，一起意外事件导致戴安娜离开家乡，与男友一起来到我们的世界，化身神奇女侠
在一战期间成为地球的守护者。
该片于2017年6月2日在美国、中国内地同步上映 。''',
    '神奇女侠2': '''《神奇女侠2》是由派蒂·杰金斯执导，盖尔·加朵、克里斯·派恩等主演的动作片，于2020年10月2日在美国上映 。
据2020年 3月18日新京报显示，《神奇女侠2》发布日本版预告片，强调"神奇女侠"创造的史上多个NO.1，包括第一部曾创过女性超级英雄片全球票房第一。
盖尔·加朵扮演的神奇女侠霸气回归，克里斯·派恩扮演的史蒂夫·特雷佛、佩德罗·帕斯卡扮演的麦克斯·罗德、克里斯汀·韦格扮演的猎豹女也在预告中现身。该片预
计6月12日在日本上映 。'''
}

movie = input('请输入电影名查看简介：')
# print(d[movie])
print(d.get(movie))
