节目单 = [{'评分及订阅量': [10.0, 536], '播放量': '12.4万', '标签': ['相声评书', '德云社', '相声', '对口相声'],
           '专辑名': '德云二小园子新街口剧场站2021', '相声演员': ['栾云平', '谢金', '高峰']},
          {'评分及订阅量': [9.8, 11000], '播放量': '119.6万', '标签': ['相声评书', '岳云鹏', '德云社',
                                                                       '相声', '对口相声'],
           '专辑名': '德云社岳云鹏相声专场天津站2018', '相声演员': ['岳云鹏', '孙越']},
          {'评分及订阅量': [9.6, 5074], '播放量': '157.6万', '标签': ['相声评书', '德云社', '相声',
                                                                      '郭德纲', '对口相声'],
           '专辑名': '德云社郭德纲相声专场济南站 2018', '相声演员': ['郭德纲', '于谦']}
          ]
name = input('请输入你要查询的演员：')
for item in 节目单:  # 遍历列表 -->{}，item 是一个又一个的字典
    演员表 = item['相声演员']
    for 相声演员 in 演员表:
        if name in 相声演员:
            print(name, '出演了', item['专辑名'])
