# 哈尔滨地铁 1 号线运行图
print('地铁1号线\t\t\t哈尔滨东站→新疆大街')
print('\t\t起点站首车时间：06:00')
print('\t\t起点站末车时间：22:30\t\t单程最高票价：6.00元')
print('-------------------------------------------------------------------------------')
print(
    '   1\t\t 2\t\t   3\t   4\t  5\t     6\t   7\t  8\t      9\t     10\t     11\t      12\t 13\t      14\t   15\t      16\t 17\t     18\t\t 22\t      23')
print(
    '   ⇌    \t ⇌\t       ⇌\t   ⇌\t  ⇌ \t ⇌\t   ⇌\t  ⇌\t  ⇌\t ⇌\t     ⇌\t      ⇌\t ⇌\t      ⇌\t   ⇌\t      ⇌\t ⇌\t     ⇌\t     ⇌\t      ⇌\t ')
print(
    '哈尔滨东站\t桦树街\t交通学院\t 太平桥\t工程大学\t烟厂\t医大一院\t博物馆\t铁路局\t哈工大\t西大桥\t和兴路\t学府路\t理工大学\t黑龙江大学\t医大二院\t哈达\t  哈尔滨南站\t渤海路\t新疆大街')
