评书新势力 = {'评书新势力作品集': ['         2021-09', '32', ' 30', '7624'],
         '端木范读SK<道德经>标准朗诵': ['2020-10', '81', ' 21', '6463'],
         '静心养性&端木精品雅读(SK)': ['2019-01', '111', '16', '5340'],
         '水浒全传(SK)': ['           2020-04', '25', ' 28', '4259']}
print('专辑名称\t\t\t\t\t\t       上架时间\t   声音数\t订阅量\t 播放量')
for item in 评书新势力:
    print(item, end='             ')
    for i in 评书新势力[item]:
        print(i, end='      ')
    print()  # 换行
# 输入要收听的专辑
book = input('请输入您要收听的专辑：')
person = input(('请输入您在喜马拉雅中的昵称：'))
s = f'您已订阅了《{book}》，'
s_info = 评书新势力[book]  # 获取专辑详细信息
s += '上架时间为'+s_info[0]+'，声音数为'+s_info[1]+'，订阅量为'+s_info[2]+'，播放量为'+s_info[3]
print(f'{s}。{person}，您现在可以收听您喜欢的专辑了。【评书新势力SK书场】')
